---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationHangerHostNotFound
source: html/a45ca5d7-ace1-6b12-806c-2e00f62886d9.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationHangerHostNotFound Property

The hanger will disconnect because we can't find the suitable host.

## Syntax (C#)
```csharp
public static FailureDefinitionId FabricationHangerHostNotFound { get; }
```